eisup_2019_docmng_integration/src/InformationRegisters/НастройкиОбменаСКлиентомБанка/НастройкиОбменаСКлиентомБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбменаСКлиентомБанка</name>
  <resources>
    <name>Программа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидыВыгружаемыхПлатДокументов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФайлВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеКонтролироватьОкончаниеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/НастройкиОбменаСКлиентомБанка/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.БанковскийСчет) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита ""Банковский Счет""", Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Организация) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита ""Организация""", Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Программа) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита ""Программа""", Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Кодировка) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение реквизита ""Кодировка""", Отказ);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
